Repository: atharvsalvi/farmer-s-app
Catalog: lib/l10n/app_*.arb
Languages: hi, mr

# welcomeTitle
source: Smart Farming For a Better Future
hi: स्मार्ट खेती बेहतर भविष्य के लिए
mr: स्मार्ट शेती उज्ज्वल भविष्यासाठी

# welcomeSubtitle
source: AI-powered insights for optimal crop growth and yield.
hi: इष्टतम फसल वृद्धि और उपज के लिए एआई-संचालित अंतर्दृष्टि।
mr: चांगल्या पिकाच्या वाढीसाठी आणि उत्पादनासाठी एआय-आधारित माहिती.

source: Register
hi: पंजीकरण करें
mr: नोंदणी करा

# login
source: Sign In
hi: साइन इन करें
mr: साइन इन करा

source: Create Account
hi: खाता बनाएं
mr: खाते तयार करा

source: Hello Again!
hi: पुनः नमस्ते!
mr: पुन्हा नमस्कार!

# joinRevolution
source: Join the smart farming revolution
hi: स्मार्ट खेती क्रांति में शामिल हों
mr: स्मार्ट शेती क्रांतीमध्ये सामील व्हा

# welcomeBack
source: Welcome back, you've been missed!
hi: वापसी पर स्वागत है!
mr: परत स्वागत आहे!

source: Farmer
hi: किसान
mr: शेतकरी

source: Agri Officer
hi: कृषि अधिकारी
mr: कृषी अधिकारी

# mobileHint
source: Mobile Number (10 digits)
hi: मोबाइल नंबर (10 अंक)
mr: मोबाईल नंबर (10 अंक)

# otpHint
source: Enter 6-digit OTP
hi: 6-अंकीय ओटीपी दर्ज करें
mr: 6-अंकी ओटीपी प्रविष्ट करा

source: Get OTP
hi: ओटीपी प्राप्त करें
mr: ओटीपी मिळवा

# notMember
source: Not a member? Register
hi: सदस्य नहीं हैं? पंजीकरण करें
mr: सदस्य नाही? नोंदणी करा

# alreadyMember
source: Already a member? Login
hi: पहले से सदस्य हैं? लॉगिन करें
mr: आधीच सदस्य आहात? लॉगिन करा

# dashboardTitle
source: Farmer Dashboard
hi: किसान डैशबोर्ड
mr: शेतकरी डॅशबोर्ड

source: Today's Weather
hi: आज का मौसम
mr: आजचे हवामान

source: Plan New Crop
hi: नई फसल की योजना
mr: नवीन पिकाचे नियोजन

source: Add New Crop
hi: नई फसल जोड़ें
mr: नवीन पीक जोडा

source: Current Crops
hi: वर्तमान फसलें
mr: सध्याची पिके

source: Previous Crops
hi: पिछली फसलें
mr: मागील पिके

source: Crop Health
hi: फसल स्वास्थ्य
mr: पीक आरोग्य

# checkHealth
source: Check Crop Health
hi: फसल स्वास्थ्य की जाँच करें
mr: पीक आरोग्य तपासा

# detectDisease
source: Detect Diseases & Gets Cures
hi: रोगों का पता लगाएं और इलाज पाएं
mr: रोग ओळखा आणि उपाय मिळवा

source: Market Insights
hi: बाजार अंतर्दृष्टि
mr: बाजार माहिती

source: Marketplace
hi: बाजार
mr: बाजारपेठ

# buySell
source: Buy & Sell Crops
hi: फसलें खरीदें और बेचें
mr: पिके खरेदी आणि विक्री करा

# addCropTitle
source: Add New Crop
hi: नई फसल जोड़ें
mr: नवीन पीक जोडा

source: Current Conditions
hi: वर्तमान स्थिति
mr: सध्याची स्थिती

source: Crop Type
hi: फसल का प्रकार
mr: पिकाचा प्रकार

# cropTypeHint
source: e.g., Wheat, Rice, Tomato
hi: जैसे, गेहूं, चावल, टमाटर
mr: उदा. गहू, तांदूळ, टोमॅटो

# enterCropType
source: Please enter crop type
hi: कृपया फसल का प्रकार दर्ज करें
mr: कृपया पिकाचा प्रकार प्रविष्ट करा

source: Sowing Date
hi: बुवाई की तारीख
mr: पेरणीची तारीख

source: Select Date
hi: तारीख चुनें
mr: तारीख निवडा

# selectDateError
source: Please select sowing date
hi: कृपया बुवाई की तारीख चुनें
mr: कृपया पेरणीची तारीख निवडा

source: Soil Moisture
hi: मिट्टी की नमी
mr: मातीची आर्द्रता

# moistureDry
source: Dry
hi: सूखा
mr: कोरडे

# moistureMoist
source: Moist
hi: नम
mr: ओलसर

# moistureWet
source: Extremely Moist
hi: अत्यधिक नम
mr: अत्यंत ओलसर

# addCropButton
source: Add Crop
hi: फसल जोड़ें
mr: पीक जोडा

# purchaseHistoryTitle
source: Purchase History
hi: खरीद इतिहास
mr: खरेदी इतिहास

# noPurchases
source: No purchases yet
hi: अभी तक कोई खरीद नहीं
mr: अद्याप कोणतीही खरेदी नाही

source: Quintals from
hi: क्विंटल यहाँ से
mr: क्विंटल येथून

source: Crop Health Check
hi: फसल स्वास्थ्य जाँच
mr: पीक आरोग्य तपासणी

# takePhotoPrompt
source: Take or upload a photo of the leaf
hi: पत्ती की फोटो लें या अपलोड करें
mr: पानाचा फोटो घ्या किंवा अपलोड करा

source: Camera
hi: कैमरा
mr: कॅमेरा

source: Gallery
hi: गैलरी
mr: गॅलरी

# analyzeCrop
source: Analyze Crop Health
hi: फसल स्वास्थ्य का विश्लेषण करें
mr: पीक आरोग्याचे विश्लेषण करा

source: Unknown
hi: अज्ञात
mr: अज्ञात

source: Disease Name:
hi: रोग का नाम:
mr: रोगाचे नाव:

source: Confidence:
hi: विश्वास:
mr: विश्वास:

source: Possible Causes
hi: संभावित कारण
mr: संभाव्य कारणे

source: Prevention
hi: रोकथाम
mr: प्रतिबंध

# healthyCropMessage
source: Your crop looks healthy! Keep up the good work.
hi: आपकी फसल स्वस्थ दिख रही है! अच्छा काम करते रहें।
mr: तुमचे पीक निरोगी दिसत आहे! चांगले काम करत राहा.

# marketplaceTitle
source: Marketplace
hi: बाजार
mr: बाजारपेठ

# buyCropsTab
source: Buy Crops
hi: फसलें खरीदें
mr: पिके खरेदी करा

# sellCropsTab
source: Sell Crops
hi: फसलें बेचें
mr: पिके विक्री करा

# searchBuy
source: Search crops to buy...
hi: खरीदने के लिए फसलें खोजें...
mr: खरेदी करण्यासाठी पिके शोधा...

# searchSell
source: Search crops to sell...
hi: बेचने के लिए फसलें खोजें...
mr: विक्री करण्यासाठी पिके शोधा...

source: Growth Time:
hi: विकास का समय:
mr: वाढीची वेळ:

source: View Details
hi: विवरण देखें
mr: तपशील पहा

source: Sell Details
hi: बिक्री विवरण
mr: विक्री तपशील
